Revit 2027 API
RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint Method
 Returns the default positive offset direction vector for a constraint to a Shape Driven Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetPositiveOffsetDirectionForToOtherRebarConstraint()
Public Function GetPositiveOffsetDirectionForToOtherRebarConstraint As XYZ
public:
XYZ^ GetPositiveOffsetDirectionForToOtherRebarConstraint()
member GetPositiveOffsetDirectionForToOtherRebarConstraint : unit -> XYZ
Return Value
XYZ
 Returns the default positive offset direction vector.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The TargetRebarConstraintType is not valid.
Remarks
 This is available only for constraints to a Shape Driven Rebar target.
 Valid TargetRebarConstraintType are:
RebarPlane
Edge
OutOfPlaneExtent
StartOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsStartConnectorPressent]
EndOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsEndConnectorPressent]
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace